void setup() {  
    for(int n=2;n<=9;n++)
   {
   pinMode(n,OUTPUT);  //将数字2到数字9号端口作为输出引脚
   }
}
void loop() {
  
  /*==========显示0=============*/  
  int n0[8]={0,1,1,1,1,1,1,0};       //定义数组 通过0，代表点亮相应的数码管，1代表熄灭相应的数码管
  int z=0;
  for(int x=2;x<=9;x++)          //采用循环方式依次点亮指定的数码管led（数组中0为点亮），单位时间只点亮1个led
  {
    digitalWrite(x,n0[z]);         //点亮led语句  X为引脚数  n0[z]为数组z为0-8的变量，来依次读取数组中的值
    z++;
    if (z>=9)                    //防止变量z累加超过了8
    z=0;
  }
  delay(1000);
  
  /*==========显示1=============*/  
  int n1[8]={0,1,0,0,1,0,0,0};       //定义数组 通过0，代表点亮相应的数码管，1代表熄灭相应的数码管
  z=0;
  for(int x=2;x<=9;x++)          //采用循环方式依次点亮指定的数码管led（数组中0为点亮），单位时间只点亮1个led
  {
    digitalWrite(x,n1[z]);         //点亮led语句  X为引脚数  n0[z]为数组z为0-8的变量，来依次读取数组中的值
    z++;
    if (z>=9)                    //防止变量z累加超过了8
    z=0;
  }
  delay(1000);

  /*==========显示2=============*/  
  int n2[8]={0,0,1,1,1,1,0,1};       //定义数组 通过0，代表点亮相应的数码管，1代表熄灭相应的数码管
  z=0;
  for(int x=2;x<=9;x++)          //采用循环方式依次点亮指定的数码管led（数组中0为点亮），单位时间只点亮1个led
  {
    digitalWrite(x,n2[z]);         //点亮led语句  X为引脚数  n0[z]为数组z为0-8的变量，来依次读取数组中的值
    z++;
    if (z>=9)                    //防止变量z累加超过了8
    z=0;
  }
  delay(1000);


  /*==========显示2=============*/  
  int n3[8]={0,1,1,0,1,1,0,1};       //定义数组 通过0，代表点亮相应的数码管，1代表熄灭相应的数码管
  z=0;
  for(int x=2;x<=9;x++)          //采用循环方式依次点亮指定的数码管led（数组中0为点亮），单位时间只点亮1个led
  {
    digitalWrite(x,n3[z]);         //点亮led语句  X为引脚数  n0[z]为数组z为0-8的变量，来依次读取数组中的值
    z++;
    if (z>=9)                    //防止变量z累加超过了8
    z=0;
  }
  delay(1000);

}

